---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold
source: html/a723efc0-a5a5-a157-1345-bf55a6fb4894.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold

Defines parameters for structural Sigma profile section with fold.

## Syntax (C#)
```csharp
public class StructuralSectionSigmaProfileWithFold : StructuralSectionColdFormed
```